---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.ConcreteBendingReinforcement
source: html/0005810b-32f5-0623-b094-c0c47fb50d32.htm
---
# Autodesk.Revit.DB.StructuralAsset.ConcreteBendingReinforcement Property

The bending reinforcement of the asset.

## Syntax (C#)
```csharp
public double ConcreteBendingReinforcement { get; set; }
```

## Remarks
Applies to concrete-based structural assets.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - When setting this property: the material type must be concrete to set this property.